OpenFOAM-4.x-master/tutorials/multiphase/interDyMFoam/ras/floatingObject/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=`getApplication`

runApplication blockMesh
runApplication topoSet
runApplication subsetMesh -overwrite c0 -patch floatingObject
cp -r 0.orig 0 > /dev/null 2>&1
runApplication setFields
runApplication $application

#------------------------------------------------------------------------------
